// Задайте массив на 10 целых чисел. 
// Напишите программу, которая определяет количество чётных чисел в массиве.
// Пример:
// [6 7 19 34 3 1 4 7 9 1] => 3
// [1 8 43 4 55 60 3 2 1 3] => 4

int[] arr = new int[10] { 50, 30, 80, 4, 54, 2, 7, 8, 10, 2 };
int count = 0;

    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] % 2 == 0) 
        {
            count++;
        }
    }
     Console.WriteLine($"{count} ");